package com.dxp.shiro.common

/**
 * @author carzt
 */
enum class ErrorEnum(val errorCode: Int, val errorMsg: String) {
    /**
     * 请求成功
     */
    S_200(200, "请求成功"),

    /**
     * 错误信息
     */
    E_500(500, "服务器未知异常"),
    E_601(601, "数据库异常"),
    E_701(701, "授权异常"),
    E_702(702, "认证异常"),
    E_703(703, "账号被踢出"),
    E_704(704, "账号或密码错误"),
    E_10001(10001, "数据重复添加"),
    E_10002(10002, "数据不存在"),
    E_10003(10003, "数据校验失败"),
    E_10004(10004, "读取excel失败"),
    E_10005(10005, "文件格式错误"),
    E_10006(10006, "excel模板错误"),
    E_10007(10007, "数据不可为空");

}